IDEA Open Model
PointOfID Class
Compatible with IDEA StatiCa 20.1
 Point of interaction diagram
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.PointOfID
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class PointOfID
Public Class PointOfID
The PointOfID type exposes the following members.
Constructors
Name | Description
PointOfID
Initializes a new instance of the PointOfID class
Top
Properties
Name | Description
My
 Bending moment around y-axis
Mz
 Bending moment around z-axis
N
 Normal force
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace